<?php

namespace App\Utils;

final class NumTransNameHelper
{
    const STATION_BASE_STATUS = [
        1 => '使用中',
        2 => '测试中',
    ];
    const DEVICE_BASE_TYPE = [
        1 => '烟感',
        2 => '智能节点',
        3 => '门磁',
        4 => '智能锁',
        5 => '断路监测仪'
    ];
    const WARNING_TYPE = [
        1 => '电池低电量告警',
        2 => '监测故障告警',
        3 => '电池低电量恢复',
        4 => '监测故障恢复',
        5 => '设备报警',
        6 => '设备恢复',
    ];
    const DEVICE_TYPE_STATUS = [
        0 => [0 => 2, 1 => 3,],//key是设备类型 0 烟感 0正常 =》2正常 1报警==》3
        2 => [0 => 2, 1 => 3, 3 => 3, 4 => 2],//key是设备类型  2 井盖 0 正常 =》2 1报警 =》3 是否浸水0正常1浸水 自定义3浸水，4不浸水
        4 => [0 => 3, 1 => 2,],//key是设备类型 门磁 4  0 为开 ==》3异常 1 为闭合==》2正常
        9 => [0 => 2, 1 => 3, 3 => 3, 4 => 2],//key是设备类型 智能锁 4  0 为正常 1为异常开启(门开了锁没开) 3浸水，4不浸水
    ];
    const DEVICE_TYPE_HEART = [
        0 => 'heart_records_smoke',//烟感
        2 => 'heart_records_cover',//智能结点井盖
        4 => 'heart_records_door',//门磁
        9 => 'heart_records_lock',//智能锁
    ];
    const DEVICE_TYPE_STATUS_DETAIL = [
        0 => '无告警',
        1 => '电池低电量报警',
        2 => '监测故障报警',
        3 => '电池低电量恢复',
        4 => '监测故障恢复',
        5 => '设备报警',
        6 => '设备恢复',
        7 => '浸水报警',
        8 => '浸水恢复',
        9 => '异常开启',//井盖
        10 => '异常开启恢复',//井盖恢复
        11 => '烟雾感应报警',//
        12 => '烟雾感应报警恢复',
        13 => '门锁异常打开',//门打开锁未开
        14 => '门锁恢复关闭',
        15 => '浸水报警',//门锁浸水
        16 => '浸水恢复',//门锁恢复
    ];
    const DEVICE_TYPE_STATUS_RECOVER = [
        1 => 3,
        2 => 4,
        5 => 6,
        7 => 8,
        9 => 10,
        11 => 12,
        13 => 14,
        15 => 16,
    ];
    const DEVICE_BASE_TYPE_TRANS = [
        '烟感' => 1,
        '智能节点' => 2,
        '门磁' => 3,
        '智能锁' => 4,
        '断路监测仪' => 5
    ];
    const DEVICE_BASE_TYPE_REMARK = [
        '烟感' => '独立式烟雾报警器',
        '智能节点' => 'Nb-IoT智能井盖',
        '门磁' => '门磁感应检测',
        '智能锁' => '智能锁',
        '断路监测仪' => '断路监测'
    ];
}